app/controllers/api/pokemon_controller.rb

INSERT INTO "pokemons" ("name", "attack", "defense", "poke_type", "moves", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @pokemon = Pokemon.new(pokemon_params)
    if @pokemon.save

SELECT "pokemons".* FROM "pokemons"
---
  def index
    @pokemon = Pokemon.all

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @pokemon = Pokemon.find(params[:id])